ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/HSM_HSM_TRNG_CE00A000h.xml
<module name="HSM_TRNG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="HSM_TRNG_TRNG_INPUT_0" acronym="HSM_TRNG_TRNG_INPUT_0" offset="0" width="32" description="These registers are used as input for [SP 800-90A] AES-256 DRBG testing. They share theiraddresses with the TRNG_OUTPUT_0 to TRNG_OUTPUT_3 registers.">
		<bitfield id="TRNG_INPUT" width="32" begin="31" end="0" resetval="0x0" description="These registers are used as input for [SP 800-90A] AES-256 DRBG testing." range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_TRNG_TRNG_INPUT_1" acronym="HSM_TRNG_TRNG_INPUT_1" offset="4" width="32" description="These registers are used as input for [SP 800-90A] AES-256 DRBG testing. They share theiraddresses with the TRNG_OUTPUT_0 to TRNG_OUTPUT_3 registers.">
		<bitfield id="TRNG_INPUT" width="32" begin="31" end="0" resetval="0x0" description="These registers are used as input for [SP 800-90A] AES-256 DRBG testing." range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_TRNG_TRNG_INPUT_2" acronym="HSM_TRNG_TRNG_INPUT_2" offset="8" width="32" description="These registers are used as input for [SP 800-90A] AES-256 DRBG testing. They share theiraddresses with the TRNG_OUTPUT_0 to TRNG_OUTPUT_3 registers.">
		<bitfield id="TRNG_INPUT" width="32" begin="31" end="0" resetval="0x0" description="These registers are used as input for [SP 800-90A] AES-256 DRBG testing." range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_TRNG_TRNG_INPUT_3" acronym="HSM_TRNG_TRNG_INPUT_3" offset="12" width="32" description="These registers are used as input for [SP 800-90A] AES-256 DRBG testing. They share theiraddresses with the TRNG_OUTPUT_0 to TRNG_OUTPUT_3 registers.">
		<bitfield id="TRNG_INPUT" width="32" begin="31" end="0" resetval="0x0" description="These registers are used as input for [SP 800-90A] AES-256 DRBG testing." range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_TRNG_TRNG_STATUS" acronym="HSM_TRNG_TRNG_STATUS" offset="16" width="32" description="Status register.">
		<bitfield id="NEED_CLOCK" width="1" begin="31" end="31" resetval="0x0" description="1' indicates that the TRNG is busy generating entropy or is in one of its test modes - the module clock may not be turned off. This bit is a direct mirror of the 'need_clock'output signal of the module." range="31" rwaccess="R"/>
	<bitfield id="BLOCKS_THRESH" width="7" begin="30" end="24" resetval="0x0" description="The threshold value for the 'blocks_available' field to indicate 'ready' here. The value iswritten via bits [30:24] of the TRNG_INTACK register. The number of blocks availablein the RAM buffer must be equal to or greater than the value in this field [which iscontrolled by Writing to the TRNG_INTACK register].Note: This field controls the data available interrupt [and status] gating based on thefill level of the RAM buffer. When the interrupt occurs, there is always one extraword available in the output register -  with a value of 15 here, the number ofwords that are available is 16 when data ready is indicated." range="30:24" rwaccess="R"/>
	<bitfield id="BLOCKS_AVAILABLE" width="8" begin="23" end="16" resetval="0x0" description="This field indicates the number of 128 bits blocks of random data that are available inthe random data RAM buffer [if configured]. If this value is non-zero, the outputregisters will be re-filled from the random data RAM buffer immediately afteracknowledging the 'ready' interrupt [i.e. after Writing a '1' to bit [0] of theTRNG_INTACK register]." range="23:16" rwaccess="R"/>
	<bitfield id="TEST_STUCK_OUT" width="1" begin="15" end="15" resetval="0x0" description="1' = indication that 'stuck_out' functionality testing is enabled [via TRNG_INTACKregister bit [15]]. This bit will automatically fall back to '0' when a stuck output isactually detected." range="15" rwaccess="R"/>
	<bitfield id="APROP_FAIL" width="1" begin="14" end="14" resetval="0x0" description="1' = the [SP 800-90B] 'Adaptive Proportion' test logic monitoring the data shifted intothe main shift register detected too many 8-bit Noise Source output samples matchingthe first sample taken in the test window. Bits [31:30] of the TRNG_SPB_TESTSregister indicate which of the two 'Adaptive Proportion' tests detected the error.Writing a '1' to bit [14] of the TRNG_INTACK register clears this bit to '0', also clearsbits [31:30] of the TRNG_SPB_TESTS register." range="14" rwaccess="R"/>
	<bitfield id="REPCNT_FAIL" width="1" begin="13" end="13" resetval="0x0" description="1' = the [SP 800-90B] 'Repetition Count' test logic monitoring the data shifted into themain shift register detected a number of consecutive identical 8-bit Noise Source outputsamples that matched the programmed cutoff value. Writing a '1' to bit [13] of theTRNG_INTACK register clears this bit to '0'." range="13" rwaccess="R"/>
	<bitfield id="RESERVED_0" width="2" begin="12" end="11" resetval="0x0" description="Bits should be ignored on a read." range="12:11" rwaccess="W"/>
	<bitfield id="RESEED_AI" width="1" begin="10" end="10" resetval="0x0" description="For the EIP-76d configurations with BC_DF functionality, this bit indicates when theTRNG_PS_AI_ -  registers must be written for an 'Instantiate' or 'Reseed' operation[Writing the highest Byte of the TRNG_PS_AI_11 register then clears this bit]. This bitalso indicates when the DRBG has finished updating its internal Key and V values aftergenerating random data; no specific action is required at that time.Note: This bit is only available for EIP-76d configurations with BC_DF; otherwise, itmust be treated as 'Reserved'." range="10" rwaccess="R"/>
	<bitfield id="STUCK_NRBG" width="1" begin="9" end="9" resetval="0x0" description="1' = NRBG stuck error; this happens when two identical values were extracted fromthe main shift register [configuration without Conditioning Function] or theConditioning Function output [when configured]." range="9" rwaccess="R"/>
	<bitfield id="TEST_READY" width="1" begin="8" end="8" resetval="0x0" description="Multi-purpose bit:> For known-answer tests on the 'Repetition Count', 'Adaptive Proportion','monobit', 'run' and 'poker' tests, BC_DF functionality and Conditioning Function,a '1' indicates that data can be written to the TRNG_RAW_... registers.> When testing the DRBG, a '1' indicates that test data can be written to theTRNG_INPUT_ -  registers [for separate AES core testing], result data can be readfrom the TRNG_OUTPUT_ -  registers when this bit has become '1' again afterdropping to '0'.> When testing the Noise Source, a '1' indicates that a 64 bit output block from theNoise Source is available for Reading from the TRNG_RAW_... registers, Writing a'1' to the 'test_ready_ack' bit in the TRNG_ACK register will then clear this bitagain.> For the EIP-76d configurations without BC_DF, a '1' here indicates when theTRNG_PS_AI_ -  registers can be written to set an Additional Input value for a'Generate' operation. It also indicates when those registers must be written for a'Reseed' operation or [SP 800-90A] DRBG tests. Writing the highest Byte of theTRNG_PS_AI_11 register then clears this bit.Note: For the EIP-76d configurations with BC_DF, the indication that theTRNG_PS_AI_ -  registers must be written for an 'Instantiate' or 'Reseed'operation is split off, see bit [10]." range="8" rwaccess="R"/>
	<bitfield id="MONOBIT_FAIL" width="1" begin="7" end="7" resetval="0x0" description="1' = the [AIS-31] 'monobit test' logic monitoring data shifted into the main shiftregister detected an out-of-bounds number of '1's after checking 20,000 bits [test T1 asspecified in the [AIS-31] standard]. Writing a '1' to bit [7] of the TRNG_INTACKregister clears this bit to '0'.Note: This bit is only available if AIS-31 testing logic is configured; otherwise, it mustbe treated as 'Reserved'." range="7" rwaccess="R"/>
	<bitfield id="POKER_FAIL" width="1" begin="6" end="6" resetval="0x0" description="1' = the [AIS-31] 'poker test' logic monitoring data shifted into the main shift registerdetected an out-of-bounds value in at least one of the 16 'poker_count_X' counters or anout of bounds 'sum of squares' value after checking 20,000 bits [test T2 as specified inthe [AIS-31] standard]. Writing a '1' to bit [6] of the TRNG_INTACK register clears thisbit to '0'.Note: This bit is only available if AIS-31 testing logic is configured; otherwise, it mustbe treated as 'Reserved'." range="6" rwaccess="R"/>
	<bitfield id="LONG_RUN_FAIL" width="1" begin="5" end="5" resetval="0x0" description="1' = the [AIS-31] 'run test' logic monitoring data shifted into the main shift registerdetected a sequence of 34 identical bits [test T4 as specified in the [AIS-31] standard].Writing a '1' to bit [5] of the TRNG_INTACK register clears this bit to '0'.Note: This bit is only available if AIS-31 testing logic is configured; otherwise, it mustbe treated as 'Reserved'." range="5" rwaccess="R"/>
	<bitfield id="RUN_FAIL" width="1" begin="4" end="4" resetval="0x0" description="1' = the [AIS-31] 'run test' logic monitoring data shifted into the main shift registerdetected an out-of-bounds value for at least one of the 'run_X_count_...' counters afterchecking 20,000 bits [test T3 as specified in the [AIS-31] standard]. Writing a '1' to bit[4] of the TRNG_INTACK register clears this bit to '0'.Note: This bit is only available if AIS-31 testing logic is configured; otherwise, it mustbe treated as 'Reserved'." range="4" rwaccess="R"/>
	<bitfield id="NOISE_FAIL" width="1" begin="3" end="3" resetval="0x0" description="1' = the [AIS-31] 'run test' logic monitoring data shifted into the main shift registerdetected a sequence of 48 identical bits, which is considered a 'Noise Source failure' asproposed in section E.5 of the [AIS-31] standard. Writing a '1' to bit [3] of theTRNG_INTACK register clears this bit to '0'.Note: This bit is only available if AIS-31 testing logic is configured; otherwise, it mustbe treated as 'Reserved'." range="3" rwaccess="R"/>
	<bitfield id="STUCK_OUT" width="1" begin="2" end="2" resetval="0x0" description="1' = logic around the output data registers4 detected that the EIP-76 generates the samevalue twice in a row. The word size for this comparison is 128 bits. Writing a '1' to bit[2] of the TRNG_INTACK register clears this bit to '0'." range="2" rwaccess="R"/>
	<bitfield id="SHUTDOWN_OFLO" width="1" begin="1" end="1" resetval="0x0" description="1' = the number of FROs shut down after a second 'error event' [i.e. the number of '1'bits in the TRNG_ALARMSTOP register] has exceeded the threshold set by'shutdown_threshold' in the TRNG_ALARMCNT register. Writing a '1' to bit [1] of theTRNG_INTACK register clears this bit to '0'.Note: This bit will be set to '1' when automatic detuning is enabled and an automaticdetuning is performed by the internal logic. In that case, the TRNG is notactually shut down and this bit is informative only." range="1" rwaccess="R"/>
	<bitfield id="READY" width="1" begin="0" end="0" resetval="0x0" description="1' = data is available in the TRNG_OUTPUT_0 - 3 registers. Acknowledging this stateby Writing a '1' to bit [0] of the TRNG_INTACK register clears this bit to '0'. If a newnumber is already available in the random data buffer, that number is directly movedinto the result register. In this case the 'ready' status bit is asserted again, after at mostsix module clock cycles." range="0" rwaccess="R"/>
	</register><register id="HSM_TRNG_TRNG_CONTROL" acronym="HSM_TRNG_TRNG_CONTROL" offset="20" width="32" description="Control register.">
		<bitfield id="DATA_BLOCKS" width="12" begin="31" end="20" resetval="0x0" description="This field indicates the number of 128 bit data blocks that must be generated by the [SP800-90A] AES-256 DRBG in a single 'Generate_function'. It is loaded in a write to thisregister where the 'request_data' bit is '1' [and the 're_seed' bit is '0'] and then countsdown to zero by one for each block that is generated. It is allowed to 'short-cycle' a'Generate_function' by Writing a lower value than already present [even value zero],but Writing a larger value than already present is not allowed [unless the field equalszero]. The maximum number of blocks that can be requested in one go 4095 preventsrequesting too much data in a single 'Generate_function', which is limited by SP 800-90A to generate no more than 219 bits per request.Note: This field is only present when an SP 800-90A DRBG is available.Note: This field covers Bytes 2 and 3 of this register and these Bytes must either bewritten in one go or using the 'request_hold' bit if the Byte write functionality isconfigured [which it is by default].Note: When aborting a 'Generate_function' by Writing zero here, the word beinggenerated at that time is completed normally and stored in the output buffermodule." range="31:20" rwaccess="R/W"/>
	<bitfield id="RESERVED_0" width="2" begin="19" end="18" resetval="0x0" description="Bits should be written with '0' and should be ignored on a read." range="19:18" rwaccess="W"/>
	<bitfield id="REQUEST_HOLD" width="1" begin="17" end="17" resetval="0x0" description="Read/write, this bit can only be set to '1' when the 'data_blocks' field has value zero andByte Writing only bits [23:16], setting the 'request_data' bit to '1' and loading bits[23:20] of the 'data_blocks' field. Value '1' in this bit indicates that bits [31:24] of the'data_blocks' field must be loaded with a separate Byte write, at which point this bit fallsback to '0' and the actual 'Generate_function' is started. Any other write of this registerwith this bit at '1' clears this bit but also clears the buffered 'data_blocks' value.Note: This bit is only present when an [SP 800-90A] AES-256 DRBG is available andByte Writing is configured [the latter is the default]." range="17" rwaccess="R/W"/>
	<bitfield id="REQUEST_DATA" width="1" begin="16" end="16" resetval="0x0" description="Write-only, Writing a '1' indicates that the 'data_blocks' field contains the number of128 bit data blocks that the [SP 800-90A] AES-256 DRBG should generate in a single'Generate_function'. Writing a '0' has no effect.Note: This bit is only present when an SP 800-90A AES-256 DRBG is available andcan only be set to '1' when 'enable_trng' and 'drbg_en' were '1' before thewrite.Note: When Writing a '1' here, only the 'data_blocks' field in this register is changed.Re-seeding takes priority over data generation.Note: When Byte-Writing only bits [23:16] with this bit at '1' and 'request_hold' at '0',bits [31:24] of the 'data_blocks' field are cleared to zeroes." range="16" rwaccess="R/W"/>
	<bitfield id="RE_SEED" width="1" begin="15" end="15" resetval="0x0" description="Set-only, Writing a '1' starts a 'Reseed' as described in section 5.2.5.4 below, Writing a'0' has no effect.This bit falls back to '0' automatically after the 'Reseed' operation is complete -  at thattime the 'block_count' field in the TRNG_BLOCKCNT register is reset to zero and therandom data buffer is zeroized so that any new data read from the EIP-76 will use thenew seed values.Note: This bit is only present when an [SP 800-90A] AES-256 DRBG is available andcan only be set to '1' when 'enable_trng' and 'drbg_en' were '1' before thewrite.Note: When Writing a '1' here, all other bits in this register remain unchanged. Reseedingtakes priority over data generation." range="15" rwaccess="R/W"/>
	<bitfield id="APROP_FAIL_MASK" width="1" begin="14" end="14" resetval="0x0" description="1' = allow the 'aprop_fail' bit in the TRNG_STATUS register to activate the [active'high'] 'irq' output." range="14" rwaccess="R/W"/>
	<bitfield id="REPCNT_FAIL_MASK" width="1" begin="13" end="13" resetval="0x0" description="1' = allow the 'repcnt_fail' bit in the TRNG_STATUS register to activate the [active'high'] 'irq' output." range="13" rwaccess="R/W"/>
	<bitfield id="DRBG_EN" width="1" begin="12" end="12" resetval="0x0" description="Enable the [SP 800-90A] AES-256 DRBG. If this bit is reset to '0', the DRBG is forcedback into the idle state immediately.Note: This bit is only present when the SP 800-90A AES-256 DRBG is available andcan only be changed when 'enable_trng' was '0' before the write.To change this bit during operation, it is required to first put the EIP-76 into reset['enable_trng' = 0]. If the DRBG is enabled, it can be disabled by a subsequent write of'0' to 'drbg_en' [Writing this bit when 'enable_trng' is still '1' has no effect, so itrequires TWO writes to this register to disable the DRBG in that case]. The DRBG thenstops immediately. To enable it, the 'drbg_en' bit must be written with '1'. Afterchanging the state, the EIP-76 must be started again by setting the 'enable_trng' bit to'1'. Note that it is required to re-gather entropy, so the same number of start-up cycleswill be used as when starting the EIP-76 out of a system reset state." range="12" rwaccess="R/W"/>
	<bitfield id="NO_WHITENING" width="1" begin="11" end="11" resetval="0x0" description="The default value of '0' means that toggle-flop whitening of the noise source is enabled.Set this bit to '1' to disable the toggle flip-flop based whitening of the noise source, seesection 3.2 for details. In this mode, the sampling interval is the number of clocksspecified in sample_div multiplied by the factor specified in sample_cycles [and scale]." range="11" rwaccess="R/W"/>
	<bitfield id="ENABLE_TRNG" width="1" begin="10" end="10" resetval="0x0" description="Setting this bit to '1' starts the EIP-76, gathering entropy from the FROs. Resetting thisbit to '0' forces all NRBG logic back into the idle state immediately.For the [SP 800-90A] DRBG option, starting the EIP-76 with the 'drbg_en' bit value '1'performs a CTR_DRBG 'Instantiate' operation [with or without BC_DF, as perconfiguration] with a 'Personalization String' as written to the TRNG_PS_AI_...registers at that time. Resetting this bit to '0' performs the 'Un-instantiate' operation,clearing all internal post-processor registers." range="10" rwaccess="R/W"/>
	<bitfield id="STUCK_NRBG_MASK" width="1" begin="9" end="9" resetval="0x0" description="1' = allow the 'stuck_nrbg' bit in the TRNG_STATUS register to activate the [active'high'] 'irq' output." range="9" rwaccess="R/W"/>
	<bitfield id="TEST_MODE" width="1" begin="8" end="8" resetval="0x0" description="1' = Enables access to [amongst others] the TRNG_COUNT and TRNG_RAW_L/Hregisters [the latter are cleared before enabling access] and keep 'need_clock' outputactive 'high' for testing purposes. This bit must be set to '1' before various test modesin the TRNG_TEST register can be enabled [see section 5.2.21]." range="8" rwaccess="R/W"/>
	<bitfield id="MONOBIT_FAIL_MASK" width="1" begin="7" end="7" resetval="0x0" description="1' = allow the 'monobit_fail' bit in the TRNG_STATUS register to activate the [active'high'] 'irq' output.Note: This bit is only available if AIS-31 testing logic is configured, otherwise it mustbe treated as 'Reserved'." range="7" rwaccess="R/W"/>
	<bitfield id="POKER_FAIL_MASK" width="1" begin="6" end="6" resetval="0x0" description="1' = allow the 'poker_fail' bit in the TRNG_STATUS register to activate the [active'high'] 'irq' output.Note: This bit is only available if AIS-31 testing logic is configured, otherwise it mustbe treated as 'Reserved'" range="6" rwaccess="R/W"/>
	<bitfield id="LONG_RUN_FAIL_MASK" width="1" begin="5" end="5" resetval="0x0" description="1' = allow the 'long_run_fail' bit in the TRNG_STATUS register to activate the [active'high'] 'irq' output.Note: This bit is only available if AIS-31 testing logic is configured, otherwise it mustbe treated as 'Reserved'." range="5" rwaccess="R/W"/>
	<bitfield id="RUN_FAIL_MASK" width="1" begin="4" end="4" resetval="0x0" description="1' = allow the 'run_fail' bit in the TRNG_STATUS register to activate the [active 'high']'irq' output.Note: This bit is only available if AIS-31 testing logic is configured, otherwise it mustbe treated as 'Reserved'." range="4" rwaccess="R/W"/>
	<bitfield id="NOISE_FAIL_MASK" width="1" begin="3" end="3" resetval="0x0" description="1' = allow the 'noise_fail' bit in the TRNG_STATUS register to activate the [active'high'] 'irq' output.Note: This bit is only available if AIS-31 testing logic is configured, otherwise it mustbe treated as 'Reserved'." range="3" rwaccess="R/W"/>
	<bitfield id="STUCK_OUT_MASK" width="1" begin="2" end="2" resetval="0x0" description="1' = allow the 'stuck_out' bit in the TRNG_STATUS register to activate the [active'high'] 'irq' output." range="2" rwaccess="R/W"/>
	<bitfield id="SHUTDOWN_OFLO_MASK" width="1" begin="1" end="1" resetval="0x0" description="1' = allow the 'shutdown_oflo' bit in the TRNG_STATUS register to activate the [active'high'] 'irq' output." range="1" rwaccess="R/W"/>
	<bitfield id="READY_MASK" width="1" begin="0" end="0" resetval="0x0" description="1' = allow the 'ready' bit in the TRNG_STATUS register to activate the [active 'high']'irq' output." range="0" rwaccess="R/W"/>
	</register><register id="HSM_TRNG_TRNG_CONFIG" acronym="HSM_TRNG_TRNG_CONFIG" offset="24" width="32" description="Configuration register.">
		<bitfield id="SAMPLE_CYCLES" width="16" begin="31" end="16" resetval="0x0" description="This field, together with the 'scale' field, defines the number of clock cycles beforeshifting the main shift register and thereby freezing the noise sample. This value mustbe such that there is at least one bit of entropy [in total] in each 8 bits that are shifted.When the 'no_whitening' bit in the TRNG_CONTROL register is set, only the last FROsample is taken and shifted in. When the 'no_whitening' bit is not set, a FRO sample istaken every clock cycle and accumulated via XOR before finally shifting it in.This field can only be modified while 'enable_trng' in TRNG_CONTROL is '0' or wheneither of the 'test_known_noise' or 'test_cond_func' bits in TRNG_TEST is '1'. Value 0 inthis field selects 65536 * 4^scale clock cycles between shifting." range="31:16" rwaccess="R/W"/>
	<bitfield id="READ_TIMEOUT" width="4" begin="15" end="12" resetval="0x0" description="This field controls the secure Reading mode [see section 5.2.6.2]. Value 0 disablessecure Reading, values in the range 1 - 15 enable secure Reading and set a read gateclosure timeout of approximately [read_timeout] x 16 'clk' input cycles.This field can only be modified while 'enable_trng' in TRNG_CONTROL is '0'." range="15:12" rwaccess="R/W"/>
	<bitfield id="SAMPLE_DIV" width="4" begin="11" end="8" resetval="0x0" description="This field directly controls the number of 'clk' input cycles between samples takenfrom the FROs. The default value 0 indicates that samples are taken every 'clk' cycle,maximum value 15 [decimal] takes one sample every 16 'clk' cycles.This field must be set to a value such that the slowest FRO [even under worst-caseconditions] has a cycle time less than twice the sample period. As delivered, the defaultconfiguration of the FROs should allow this field to remain 0 -  this must, however, beconfirmed with post-placement and routing timing analysis.This field can only be modified while 'enable_trng' in TRNG_CONTROL is '0' or wheneither of the 'test_known_noise' or 'test_cond_func' bits in TRNG_TEST is '1'." range="11:8" rwaccess="R/W"/>
	<bitfield id="SCALE" width="2" begin="7" end="6" resetval="0x0" description="This field sets the scale factor for the 'sample_cycles' value:0 -> number of XOR-ed FRO samples equals 'sample_cycles'1 -> number of XOR-ed FRO samples equals 'sample_cycles' x 42 -> number of XOR-ed FRO samples equals 'sample_cycles' x 163 -> number of XOR-ed FRO samples equals 'sample_cycles' x 64This field can only be modified while 'enable_trng' in TRNG_CONTROL is '0' or wheneither of the 'test_known_noise' or 'test_cond_func' bits in TRNG_TEST is '1'." range="7:6" rwaccess="R/W"/>
