ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/HSM_HSM_TRNG_CE00A000h.xml
	<bitfield id="USE_STARTUP_BITS" width="1" begin="5" end="5" resetval="0x0" description="Do not discard the first 512 bits of raw data. This reduces the start-up time, but maymore frequently cause start-up health test failures.For configurations without Conditioning function: When enabled, the first 128 bits willstill be discarded instead." range="5" rwaccess="R/W"/>
	<bitfield id="NOISE_BLOCKS" width="5" begin="4" end="0" resetval="0x0" description="This field sets the number of 512-bit blocks of raw Noise Source output data that mustbe processed by either the Conditioning Function or the SP 800-90 DRBG 'BC_DF'functionality to yield a 'full entropy' output value. As according to [SP 800-90B] theamount of entropy input to this functionality must be twice the amount that is outputand the 8-bit samples output by the Noise Source are supposed to have one bit ofentropy each, the settings for this field are as follows:> SHA-1 Conditioning Function: generates 160 bits output, requiring2560samplebits, equivalent to 5 blocks of raw Noise Source input.> SHA-256 Conditioning Function: generates 256 bits output, requiring4096samplebits, equivalent to 8 blocks of raw Noise Source input. Note that two blocks of 256bits are needed to 'Instantiate' or 'Reseed' the SP 800-90 DRBG [in the EIP-76d-*-SHA2 configurations].> SP 800-90 DRBG 'BC_DF' functionality: generates 384 bits output, requiring6144sample bits, equivalent to 12 blocks of raw Noise Source input.This field can only be modified while 'enable_trng' in TRNG_CONTROL is '0' or wheneither of the 'test_known_noise' or 'test_cond_func' bits in TRNG_TEST is '1'. Value 0 inthis field selects 32 blocks of 512 bits to be processed." range="4:0" rwaccess="R/W"/>
	</register><register id="HSM_TRNG_TRNG_ALARMCNT" acronym="HSM_TRNG_TRNG_ALARMCNT" offset="28" width="32" description="Shutdown interr. ctrl register.">
		<bitfield id="RESERVED_2" width="2" begin="31" end="30" resetval="0x0" description="Bits should be written with a '0' and should be ignored on a read." range="31:30" rwaccess="W"/>
	<bitfield id="SHUTDOWN_COUNT" width="6" begin="29" end="24" resetval="0x0" description="Read-only, indicates the number of '1' bits in the TRNG_ALARMSTOP register.This field is 6 bits wide to allow up to 32 'ones' to be indicated. The actual maximumvalue equals the number of FROs." range="29:24" rwaccess="R/W"/>
	<bitfield id="SHUTDOWN_FATAL" width="1" begin="23" end="23" resetval="0x0" description="1' = Consider the 'shutdown_oflo' interrupt as a fatal error requiring taking the completeTRNG engine off-line" range="23" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="2" begin="22" end="21" resetval="0x0" description="Bits should be written with a '0' and should be ignored on a read." range="22:21" rwaccess="W"/>
	<bitfield id="SHUTDOWN_THRESHOLD" width="5" begin="20" end="16" resetval="0x0" description="Threshold setting for generating the 'shutdown_oflo' interrupt, which is activated whenthe 'shutdown_count' value in this register exceeds the threshold value set here." range="20:16" rwaccess="R/W"/>
	<bitfield id="STALL_RUN_POKER" width="1" begin="15" end="15" resetval="0x0" description="1' = Stall the 'monobit test', 'run test' and 'poker test' circuits when either the'monobit_fail', 'run_fail' or 'poker_fail' bits in the TRNG_STATUS register are set to '1' - this allows inspecting the state of the result counters [which would otherwise be resetimmediately for the next 20,000 bits block to test]." range="15" rwaccess="R/W"/>
	<bitfield id="RESERVED_0" width="7" begin="14" end="8" resetval="0x0" description="Bits should be written with a '0' and should be ignored on a read." range="14:8" rwaccess="W"/>
	<bitfield id="ALARM_THRESHOLD" width="8" begin="7" end="0" resetval="0x255" description="Alarm detection threshold for the repeating pattern detectors on each FRO. A FRO'alarm event' is declared when a repeating pattern [of up to four samples length] isdetected continuously for the number of samples defined by this field's value. Resetvalue 255 [decimal] should keep the number of 'alarm events' to a manageable level." range="7:0" rwaccess="R/W"/>
	</register><register id="HSM_TRNG_TRNG_FROENABLE" acronym="HSM_TRNG_TRNG_FROENABLE" offset="32" width="32" description="FRO enables register.">
		<bitfield id="RESERVED_4" width="8" begin="31" end="24" resetval="0x0" description="Bits should be written with a '0' and should be ignored on a read." range="31:24" rwaccess="W"/>
	<bitfield id="TRNG_FROENABLE" width="24" begin="23" end="0" resetval="0x255" description="Enable bits for the individual FROs. A '1' in bit [n] enables FRO 'n'. The default stateis all ones to enable all FROs after power-up. Note that they are not actually started upbefore the 'enable_trng' bit in the TRNG_CONTROL register is set to '1'. A bit isautomatically forced to '0' here [and cannot be written to '1'] when the correspondingbit in the TRNG_ALARMSTOP register has value '1'." range="23:0" rwaccess="R/W"/>
	</register><register id="HSM_TRNG_TRNG_FRODETUNE" acronym="HSM_TRNG_TRNG_FRODETUNE" offset="36" width="32" description="FRO de-tune bits register.">
		<bitfield id="RESERVED_5" width="8" begin="31" end="24" resetval="0x0" description="Bits should be written with a '0' and should be ignored on a read." range="31:24" rwaccess="W"/>
	<bitfield id="TRNG_FRODETUNE" width="24" begin="23" end="0" resetval="0x0" description="De-tune bits for the individual FROs. A '1' in bit [n] lets FRO 'n' run approximately5 0.000000aster. The value of one of these bits may only be changed while the correspondingFRO is turned off [by temporarily Writing a '0' in the corresponding bit of theTRNG_FROENABLE register]." range="23:0" rwaccess="R/W"/>
	</register><register id="HSM_TRNG_TRNG_ALARMMASK" acronym="HSM_TRNG_TRNG_ALARMMASK" offset="40" width="32" description="Alarm event log register.">
		<bitfield id="RESERVED_6" width="8" begin="31" end="24" resetval="0x0" description="Bits should be written with a '0' and should be ignored on a read." range="31:24" rwaccess="W"/>
	<bitfield id="TRNG_ALARMMASK" width="24" begin="23" end="0" resetval="0x0" description="Logging bits for the 'alarm events' of individual FROs. A '1' in bit [n] indicates FRO'n' experienced an 'alarm event'." range="23:0" rwaccess="R/W"/>
	</register><register id="HSM_TRNG_TRNG_ALARMSTOP" acronym="HSM_TRNG_TRNG_ALARMSTOP" offset="44" width="32" description="Alarm shutdown register.">
		<bitfield id="RESERVED_7" width="8" begin="31" end="24" resetval="0x0" description="Bits should be written with a '0' and should be ignored on a read." range="31:24" rwaccess="W"/>
	<bitfield id="TRNG_ALARMSTOP" width="24" begin="23" end="0" resetval="0x0" description="Logging bits for the 'alarm events' of individual FROs. A '1' in bit [n] indicates FRO'n' experienced more than one 'alarm event' in quick succession and has been turnedoff. A '1' in this field forces the corresponding bit in the TRNG_FROENABLE registerto '0'." range="23:0" rwaccess="R/W"/>
	</register><register id="HSM_TRNG_TRNG_RAW_L" acronym="HSM_TRNG_TRNG_RAW_L" offset="48" width="32" description="Raw noise bits [31:0].">
		<bitfield id="TRNG_RAW_L" width="32" begin="31" end="0" resetval="0x0" description="When 'test_mode' in TRNG_CONTROL = '1', 'test_noise' in TRNG_TEST = '1' and'test_shiftreg' in TRNG_TEST = '0': read-only access to the main shift register's readbuffer register bits [31:0].When 'test_mode' in TRNG_CONTROL = '1', 'test_noise' in TRNG_TEST = '1' and'test_shiftreg' in TRNG_TEST = '1': read-only access to main shift register bits [31:0].When 'test_mode' in TRNG_CONTROL = '1' and 'test_known_noise' in TRNG_TEST ='1': write-only access to main shift register bits [31:0] [read buffer register bits [31:0]are also written with the same value but generally not used]." range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_TRNG_TRNG_RAW_H" acronym="HSM_TRNG_TRNG_RAW_H" offset="52" width="32" description="Raw noise bits [63:32].">
		<bitfield id="TRNG_RAW_H" width="32" begin="31" end="0" resetval="0x0" description="When 'test_mode' in TRNG_CONTROL = '1', 'test_noise' in TRNG_TEST = '1' and'test_shiftreg' in TRNG_TEST = '0': read-only access to the main shift register's readbuffer register bits [63:32].When 'test_mode' in TRNG_CONTROL = '1', 'test_noise' in TRNG_TEST = '1' and'test_shiftreg' in TRNG_TEST = '1': read-only access to main shift register bits [63:32].When 'test_mode' in TRNG_CONTROL = '1' and 'test_known_noise' in TRNG_TEST ='1': write-only access to main shift register bits [63:32] [read buffer register bits [63:32]are also written with the same value value but generally not used]." range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_TRNG_TRNG_SPB_TESTS" acronym="HSM_TRNG_TRNG_SPB_TESTS" offset="56" width="32" description="SP 800-90B tests control/state.">
		<bitfield id="APROP_512_FAIL" width="1" begin="31" end="31" resetval="0x0" description="Bit indicating that the 'aprop_512_counter' was equal to the 'aprop_512_cutoff' setting.The state of this bit is OR-ed with the 'aprop_64_fail' bit into the 'aprop_fail' bit in theTRNG_STATUS register and cleared to '0' when Writing a '1' to the 'aprop_fail_ack' bitof the TRNG_INTACK register. While normally read-only, this bit can be written when'test_spb' in TRNG_TEST is '1'." range="31" rwaccess="R/W"/>
	<bitfield id="APROP_64_FAIL" width="1" begin="30" end="30" resetval="0x0" description="Bit indicating that the 'aprop_64_counter' was equal to the 'aprop_64_cutoff' setting. Thestate of this bit is OR-ed with the 'aprop_512_fail' bit into the 'aprop_fail' bit in theTRNG_STATUS register and cleared to '0' when Writing a '1' to the 'aprop_fail_ack' bitof the TRNG_INTACK register. While normally read-only, this bit can be written when'test_spb' in TRNG_TEST is '1'." range="30" rwaccess="R/W"/>
	<bitfield id="SHOW_VALUES" width="1" begin="29" end="29" resetval="0x0" description="Bit controlling what is actually accessible in this register; can only be set to '1' when'test_spb' in TRNG_TEST is '1'. When Writing this bit to a different value, all other bitsin this register are preserved.When Writing both 'show_counters' and 'show_values' with a '1' while 'test_spb' inTRNG_TEST is '1', all bits in this register are preserved but the 12-bit internal cyclecounter for the 'Adaptive Proportion' tests is reset to its initial state." range="29" rwaccess="R/W"/>
	<bitfield id="SHOW_COUNTERS" width="1" begin="28" end="28" resetval="0x0" description="Bit controlling what is actually accessible in this register; can only be set to '1' when'show_values' is written '0' and 'test_spb' in TRNG_TEST is '1'. When Writing this bitto a different value all other bits in this register are preserved.When Writing both 'show_counters' and 'show_values' with a '1' while 'test_spb' inTRNG_TEST is '1', all bits in this register are preserved but the 12-bit internal cyclecounter for the 'Adaptive Proportion' tests is reset to its initial state." range="28" rwaccess="R/W"/>
	<bitfield id="RESERVED_2" width="3" begin="27" end="25" resetval="0x0" description="Bits should be written with a '0' and should be ignored on a read while 'show_values'equals '1'." range="27:25" rwaccess="W"/>
	<bitfield id="APROP_512_CUTOFF" width="9" begin="24" end="16" resetval="0x0" description="Adaptive Proportion' test cutoff value for the 512 Noise Source samples window sizetest, accessible when 'show_counters' and 'show_values' are both '0'. The reset value of325 corresponds to the cutoff value for a false positive rate  of 2-30 and 1 bit of entropyper 8-bit Noise Source sample. This field can only be modified while 'enable_trng' inTRNG_CONTROL is '0' or 'test_spb' in TRNG_TEST is '1'. Value 0 in this fielddisables the 'Adaptive Proportion' test with 512 Noise Source samples window size." range="24:16" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="2" begin="15" end="14" resetval="0x0" description="Bits should be written with a '0' and should be ignored on a read while 'show_values'equals '0'." range="15:14" rwaccess="W"/>
	<bitfield id="APROP_64_CUTOFF" width="6" begin="13" end="8" resetval="0x0" description="Adaptive Proportion' Noise Source sample compare value for the 64 Noise Sourcesamples window size test, accessible when 'show_values' is '1'. This field is writeablefor testing purposes." range="13:8" rwaccess="R/W"/>
	<bitfield id="RESERVED_0" width="2" begin="7" end="6" resetval="0x0" description="Bits should be written with a '0' and should be ignored on a read while 'show_values'equals '0'." range="7:6" rwaccess="W"/>
	<bitfield id="REPCNT_CUTOFF" width="6" begin="5" end="0" resetval="0x0" description="Repetition Count' test cutoff value, accessible when 'show_counters' and 'show_values'are both '0'. The reset value of 31 corresponds to the cutoff value for a false positiverate  of 2-30 and 1 bit of entropy per 8-bit Noise Source sample. This field can only bemodified while 'enable_trng' in TRNG_CONTROL is '0' or 'test_spb' in TRNG_TEST is'1'. Value 0 in this field disables the 'Repetition Count' test." range="5:0" rwaccess="R/W"/>
	</register><register id="HSM_TRNG_TRNG_COUNT" acronym="HSM_TRNG_TRNG_COUNT" offset="60" width="32" description="Main timing counters register.">
		<bitfield id="RESERVED_1" width="2" begin="31" end="30" resetval="0x0" description="Bits should be written with a '0' and should be ignored on a read." range="31:30" rwaccess="W"/>
	<bitfield id="SAMPLE_CYC_EXT" width="6" begin="29" end="24" resetval="0x0" description="Extension bits for the sample cycle counter, used when the 'scale' field in theTRNG_CONFIG register is non-zero. This counter can only be accessed when the'test_mode' bit in TRNG_CONTROL is set to '1'." range="29:24" rwaccess="R/W"/>
	<bitfield id="RESERVED_0" width="3" begin="23" end="21" resetval="0x0" description="Bits should be written with a '0' and should be ignored on a read." range="23:21" rwaccess="W"/>
	<bitfield id="NOISE_BLK_CNT" width="5" begin="20" end="16" resetval="0x0" description="Noise blocks counter used to control the number of 512-bits noise blocks to be handledby the SHA-1/SHA-256 Conditioning Function or BC_DF functionality in the SP 800-90A DRBG [depending on configuration]. The start value of this counter is 1, which isalso the value to which it is reset when it reaches the value of the 'noise_blocks' field inthe TRNG_CONFIG register. This counter can only be accessed when 'test_mode' bit inTRNG_CONTROL is set to '1', restricted to read-only accesses when the 'test_noise' bitin the TRNG_TEST register is '1'." range="20:16" rwaccess="R/W"/>
	<bitfield id="SAMPLE_CYC_CNT" width="16" begin="15" end="0" resetval="0x0" description="Lowest 16 bits of the sample cycle counter used to control the number of [XOR-ed]FRO samples that are XOR-ed together into a single noise bit. The start value of thiscounter is 1, which is also the value to which it is reset when it reaches the valuedefined by the 'sample_cycles' and 'scale' fields in the TRNG_CONFIG register. Thiscounter can only be accessed when the 'test_mode' bit in TRNG_CONTROL is set to '1'.Note: If the 'no_whitening' bit in the TRNG_CONTROL register is set to '1', the XORingof FRO samples is not done; the noise bit is then the last FRO sample of theinterval timed by this counter." range="15:0" rwaccess="R/W"/>
	</register><register id="HSM_TRNG_TRNG_PS_AI_0" acronym="HSM_TRNG_TRNG_PS_AI_0" offset="64" width="32" description="DRBG input (LSW).">
		<bitfield id="VECTOR" width="32" begin="31" end="0" resetval="0x0" description="Bits [31:0] of the SP 800-90A 'Personalization String'/'Nonce' [Instantiate function] or'Additional Input' [Reseed and Generate functions]. This register is only availablewhen an SP 800-90A DRBG is configured." range="31:0" rwaccess="W"/>
	</register><register id="HSM_TRNG_TRNG_PS_AI_1" acronym="HSM_TRNG_TRNG_PS_AI_1" offset="68" width="32" description="DRBG input.">
		<bitfield id="VECTOR" width="32" begin="31" end="0" resetval="0x0" description="Bits [63:32] of the SP 800-90A 'Personalization String'/'Nonce' [Instantiate function]or 'Additional Input' [Reseed and Generate functions]. This register is only availablewhen an SP 800-90A DRBG is configured." range="31:0" rwaccess="W"/>
	</register><register id="HSM_TRNG_TRNG_PS_AI_2" acronym="HSM_TRNG_TRNG_PS_AI_2" offset="72" width="32" description="DRBG input.">
		<bitfield id="VECTOR" width="32" begin="31" end="0" resetval="0x0" description="Bits [95:64] of the SP 800-90A 'Personalization String'/'Nonce' [Instantiate function]or 'Additional Input' [Reseed and Generate functions]. This register is only availablewhen an SP 800-90A DRBG is configured." range="31:0" rwaccess="W"/>
	</register><register id="HSM_TRNG_TRNG_PS_AI_3" acronym="HSM_TRNG_TRNG_PS_AI_3" offset="76" width="32" description="DRBG input.">
		<bitfield id="VECTOR" width="32" begin="31" end="0" resetval="0x0" description="Bits [127:96] of the SP 800-90A 'Personalization String'/'Nonce' [Instantiate function]or 'Additional Input' [Reseed and Generate functions]. This register is only availablewhen an SP 800-90A DRBG is configured." range="31:0" rwaccess="W"/>
	</register><register id="HSM_TRNG_TRNG_PS_AI_4" acronym="HSM_TRNG_TRNG_PS_AI_4" offset="80" width="32" description="DRBG input.">
		<bitfield id="VECTOR" width="32" begin="31" end="0" resetval="0x0" description="Bits [159:128] of the SP 800-90 'Personalization String'/'Nonce' [Instantiate function]or 'Additional Input' [Reseed and Generate functions]. This register is only availablewhen an SP 800-90 DRBG is configured." range="31:0" rwaccess="W"/>
	</register><register id="HSM_TRNG_TRNG_PS_AI_5" acronym="HSM_TRNG_TRNG_PS_AI_5" offset="84" width="32" description="DRBG input.">
		<bitfield id="VECTOR" width="32" begin="31" end="0" resetval="0x0" description="Bits [191:160] of the SP 800-90A 'Personalization String'/'Nonce' [Instantiate function]or 'Additional Input' [Reseed and Generate functions]. This register is only availablewhen an SP 800-90A DRBG is configured." range="31:0" rwaccess="W"/>
	</register><register id="HSM_TRNG_TRNG_PS_AI_6" acronym="HSM_TRNG_TRNG_PS_AI_6" offset="88" width="32" description="DRBG input.">
		<bitfield id="VECTOR" width="32" begin="31" end="0" resetval="0x0" description="Bits [223:192] of the SP 800-90A 'Personalization String'/'Nonce' [Instantiate function]or 'Additional Input' [Reseed and Generate functions]. This register is only availablewhen an SP 800-90A DRBG is configured." range="31:0" rwaccess="W"/>
	</register><register id="HSM_TRNG_TRNG_PS_AI_7" acronym="HSM_TRNG_TRNG_PS_AI_7" offset="92" width="32" description="DRBG input.">
		<bitfield id="VECTOR" width="32" begin="31" end="0" resetval="0x0" description="Bits [255:224] of the SP 800-90 'Personalization String'/'Nonce' [Instantiate function]or 'Additional Input' [Reseed and Generate functions]. This register is only availablewhen an SP 800-90 DRBG is configured." range="31:0" rwaccess="W"/>
	</register><register id="HSM_TRNG_TRNG_PS_AI_8" acronym="HSM_TRNG_TRNG_PS_AI_8" offset="96" width="32" description="DRBG input.">
		<bitfield id="VECTOR" width="32" begin="31" end="0" resetval="0x0" description="Bits [287:256] of the SP 800-90A 'Personalization String'/'Nonce' [Instantiate function]or 'Additional Input' [Reseed and Generate functions]. This register is only availablewhen an SP 800-90A DRBG is configured." range="31:0" rwaccess="W"/>
	</register><register id="HSM_TRNG_TRNG_PS_AI_9" acronym="HSM_TRNG_TRNG_PS_AI_9" offset="100" width="32" description="DRBG input.">
		<bitfield id="VECTOR" width="32" begin="31" end="0" resetval="0x0" description="Bits [319:288] of the SP 800-90 'Personalization String'/'Nonce' [Instantiate function]or 'Additional Input' [Reseed and Generate functions]. This register is only availablewhen an SP 800-90 DRBG is configured." range="31:0" rwaccess="W"/>
	</register><register id="HSM_TRNG_TRNG_PS_AI_10" acronym="HSM_TRNG_TRNG_PS_AI_10" offset="104" width="32" description="DRBG input.">
		<bitfield id="VECTOR" width="32" begin="31" end="0" resetval="0x0" description="Bits [351:320] of the SP 800-90A 'Personalization String'/'Nonce' [Instantiate function]or 'Additional Input' [Reseed and Generate functions]. This register is only availablewhen an SP 800-90A DRBG is configured." range="31:0" rwaccess="W"/>
	</register><register id="HSM_TRNG_TRNG_PS_AI_11" acronym="HSM_TRNG_TRNG_PS_AI_11" offset="108" width="32" description="DRBG input (MSW).">
		<bitfield id="VECTOR" width="32" begin="31" end="0" resetval="0x0" description="Bits [383:352] of the SP 800-90A 'Personalization String'/'Nonce' [Instantiate function]or 'Additional Input' [Reseed and Generate functions]. This register is only availablewhen an SP 800-90A DRBG is configured.Note: This register must be written with a [dummy] value for a 'Reseed' operation tocomplete. For BC_DF configurations, it must also be written for an'Instantiate' function." range="31:0" rwaccess="W"/>
	</register><register id="HSM_TRNG_TRNG_TEST" acronym="HSM_TRNG_TRNG_TEST" offset="112" width="32" description="Test control register.">
		<bitfield id="TEST_IRQ" width="1" begin="31" end="31" resetval="0x0" description="1' = force 'irq' output 'high' for interrupt signal connectivity testing." range="31" rwaccess="R/W"/>
	<bitfield id="FRO_TESTIN4" width="1" begin="30" end="30" resetval="0x0" description="Control bit driving the 'fro_testin4' output of the TRNG module, which connects to allthe select inputs on the test multiplexers in the FROs [see Figure 3]. The actual outputhas the state of this bit, so a '0' selects the output of the delay control multiplexers. A'1' here also forces the 'fro_enable[n]' output [with n equal to the value of the'test_select' field here] to '1' -  this allows testing the signal path through the AND-ORINVERTgate in the FROs.This bit can only be set to '1' when 'test_mode' in TRNG_CONTROL is '1' too." range="30" rwaccess="R/W"/>
	<bitfield id="FRO_TESTIN3" width="1" begin="29" end="29" resetval="0x0" description="Control bit driving the 'fro_testin3' output of the TRNG module, which connects to allthe OR inputs on the AND-OR gates in the FRO chains [see Figure 3]. The actualoutput has the state of this bit, so a '0' does not disturb the operation of the FROs.This bit can only be set to '1' when 'test_mode' in TRNG_CONTROL is '1' too." range="29" rwaccess="R/W"/>
	<bitfield id="FRO_TESTIN2_NOT" width="1" begin="28" end="28" resetval="0x0" description="Control bit driving the 'fro_testin2' output of the TRNG module, which connects to allthe AND inputs on the AND-OR gates in the FRO chains [see Figure 3]. The actualoutput is the complement of this bit, so a '0' does not disturb the operation of the FROs.This bit can only be set to '1' when 'test_mode' in TRNG_CONTROL is '1' too." range="28" rwaccess="R/W"/>
	<bitfield id="TEST_PATTERN" width="12" begin="27" end="16" resetval="0x0" description="Repeating sequence of bits to be fed into the selected FRO delay chain ['test_patt_fro' ='1'] and/or the selected FRO error detection circuit ['test_patt_det' = '1']. This field isrotated right over one bit, once every sample period, when either of these control bits is'1'. Therefore, bit [16] is the actual pattern bit fed into the test target." range="27:16" rwaccess="R/W"/>
	<bitfield id="RESERVED_0" width="1" begin="15" end="15" resetval="0x0" description="RESERVED_0" range="15" rwaccess="R/W"/>
