ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/HSM_HSM_TRNG_CE00A000h.xml
	<bitfield id="TEST_SPB" width="1" begin="14" end="14" resetval="0x0" description="1' = Enable testing of the [SP 800-90B] 'Repetition Count' and 'Adaptive Proportion'tests by allowing the 'show_counters' and 'show_values' bits in the TRNG_SPB_TESTSregister to be set non-zero. To perform Known Answer Tests on those functions, the'test_known_noise' bit in this register must be set to '1' too. The 'need_clock' output isforced active while this bit is '1'. See section 5.2.21.2 below for more information.This bit can only be set to '1' when 'test_mode' in TRNG_CONTROL is '1' too." range="14" rwaccess="R/W"/>
	<bitfield id="TEST_NOISE" width="1" begin="13" end="13" resetval="0x0" description="1' = Enable Noise Source testing, making 64 bit blocks of Noise Source outputavailable in the TRNG_RAW_... registers. When 'test_shiftreg' is '0', these must beacknowledged by Writing a '1' to the 'test_ready_ack' bit in the TRNG_ACK register.The 'need_clock' output is forced active while this bit is '1'.This bit can only be set to '1' when 'test_mode' in TRNG_CONTROL is '1' and'test_known_noise' is written with a '0'." range="13" rwaccess="R/W"/>
	<bitfield id="TEST_SELECT" width="5" begin="12" end="8" resetval="0x0" description="Number of the FRO to be tested, value should be in range 0 -  23 for the defaultconfiguration of 24 FROs." range="12:8" rwaccess="R/W"/>
	<bitfield id="TEST_SP_800_90" width="1" begin="7" end="7" resetval="0x0" description="1' = Provide direct access to the [SP 800-90A] DRBG [EIP-76d] for NIST compliantknown-answer tests [DRBG state is lost during testing]. The 'need_clock' output isforced active while this bit is '1'. See section 5.2.21.4 below for more information.This bit is only present when an [SP 800-90A] DRBG is available [EIP-76d] and canonly be set to '1' when the 'drbg_en' bit in the TRNG_CONTROL register is '1' and the'test_aes_256' bit in this register is '0' before the write. For an EIP-76 configurationwithout BC_DF, an added restriction is that the 'test_known_noise' bit in this register is'0'. For configurations that include BC_DF, this test is done using known noise input tothat function, so the 'test_known_noise' bit must be '1' to set this bit." range="7" rwaccess="R/W"/>
	<bitfield id="TEST_AES_256" width="1" begin="6" end="6" resetval="0x0" description="Dual purpose bit that is only present when an [SP 800-90A] DRBG is available [EIP-76d] and can only be set to '1' when the 'drbg_en' bit in the TRNG_CONTROL registeris '1' and the 'test_known_noise' bit in this register is '0'.When 'test_sp_800_90' is '0':'1' = Provide direct access to the [SP 800-90A] DRBG AES-256 crypto core forknown-answer tests. The 'need_clock' output is forced active while this bit is '1'.This test mode uses TRNG_KEY_0  -  TRNG_KEY_7 as key registers. Data writtento the TRNG_INPUT_ -  registers is AES-ECB encrypted to the TRNG_OUTPUT_ - registers and the DRBG state is fully preserved while doing so. See section 5.2.21.4below for more information.When 'test_sp_800_90' is '1' and BC_DF functionality is not available:'0' = perform fixed sequence SP 800-90A known answer tests, each consisting ofan 'Instantiate' followed by a 'Generate with Prediction Resistance' operation.'1' = perform variable sequence SP 800-90A known answer tests, each consistingof an 'Instantiate' operation followed by any sequence of 'Reseed' and variablelength 'Generate' operations. These 'Generate' operations can be done with orwithout 'Additional Input'.While 'test_sp_800_90' is '1', 'test_aes_256' cannot be changed. 'test_aes_256' willbe forced to '0' when 'test_sp_800_90' is cleared again." range="6" rwaccess="R/W"/>
	<bitfield id="TEST_KNOWN_NOISE" width="1" begin="5" end="5" resetval="0x0" description="1' = Allow Writing of known test data into the main shift register [Writing input data inchunks of 64 bits to the TRNG_RAW_L and TRNG_RAW_H registers] and allow Writingof the 'noise_blocks', 'sample_interval' and 'sample_cycles' fields in the TRNG_CONFIGregister. This allows testing the [SP 800-90B] 'Repetition Count' and 'AdaptiveProportion' tests, the [optional] [AIS-31] run, poker and monobit tests, the [optional]Conditioning Function and the [SP 800-90A] BC_DF function [if configured]. Whilethis bit is '1', the Noise Source is not allowed to generate entropy but any bufferedrandom data is preserved, to be loaded into the output registers as soon as this bit isreset to '0' again. The 'need_clock' output is forced active while this bit is '1'. Allcircuits using or monitoring data in the main shift register are reset to their initial stateson any change of this bit. See section 5.2.21.1 below for more information.This bit can only be set to '1' when 'test_mode' in TRNG_CONTROL is '1' too." range="5" rwaccess="R/W"/>
	<bitfield id="CONT_POKER" width="1" begin="4" end="4" resetval="0x0" description="1' = Keep 'monobit test' and 'poker test' running continuously by not resetting the'monobit_count' and 'poker_count_X' counters at the end of each 20,000 bits test block.This bit can only be set to '1' when 'test_mode' in TRNG_CONTROL is '1' too." range="4" rwaccess="R/W"/>
	<bitfield id="TEST_SHIFTREG" width="1" begin="3" end="3" resetval="0x0" description="1' = Read directly from the main shift register when 'test_noise' is set to '1', '0' = readfrom the shift register buffer [using the 'test_ready' bit in the TRNG_STATUS register toindicate that a new batch of 64 bits can be read].This bit can only be set to '1' when 'test_mode' in TRNG_CONTROL is '1' too." range="3" rwaccess="R/W"/>
	<bitfield id="TEST_PATT_DET" width="1" begin="2" end="2" resetval="0x0" description="1' = Repeatedly feed 'test_pattern' into the error detection circuit of the FRO selectedby the 'test_select' field.This bit can only be set to '1' when 'test_mode' in TRNG_CONTROL is '1' too." range="2" rwaccess="R/W"/>
	<bitfield id="TEST_PATT_FR" width="1" begin="1" end="1" resetval="0x0" description="1' = Repeatedly feed 'test_pattern' into the delay chain of the FRO selected by the'test_select' field by forcing the corresponding 'fro_enable' output 'low' and forcingthe corresponding 'fro_testin' output to the state of bit [16] of this register.This bit can only be set to '1' when 'test_mode' in TRNG_CONTROL is '1' too." range="1" rwaccess="R/W"/>
	<bitfield id="TEST_EN_OUT" width="1" begin="0" end="0" resetval="0x0" description="1' = Enable the 'tst_fro_clk_out' output, connecting to the FRO selected by the'test_select' field.This bit can only be set to '1' when 'test_mode' in TRNG_CONTROL is '1' too." range="0" rwaccess="R/W"/>
	</register><register id="HSM_TRNG_TRNG_BLOCKCNT" acronym="HSM_TRNG_TRNG_BLOCKCNT" offset="116" width="32" description="Output blocks counter.">
		<bitfield id="BLOCK_COUNT" width="28" begin="31" end="4" resetval="0x0" description="Counter for the number of 128-bit blocks generated by the DRBG. It is forced back tozero when the DRBG is disabled and cleared to zero when an internal 'Reseed'operation has finished. This register can be used by driver software to determine whento 'Reseed' the DRBG.The whole 32 bits of this register represent the amount of data [in bytes] generated sincethe last 'Reseed'." range="31:4" rwaccess="R/W"/>
	<bitfield id="RESERVED_0" width="4" begin="3" end="0" resetval="0x0" description="Bits should be written with a '0' and should be ignored on a read." range="3:0" rwaccess="W"/>
	</register><register id="HSM_TRNG_TRNG_OPTIONS" acronym="HSM_TRNG_TRNG_OPTIONS" offset="120" width="32" description="Engine options information.">
		<bitfield id="DETUNE_COUNT" width="8" begin="31" end="24" resetval="0x0" description="Indicates the number of detune events that occurred on the enabled FROs. The counteris incremented by one on each detune event up to a value 255. The counter will remainat 255 when more detune events occur. The counter can be cleared by Writing value0xFF to this field [any other value has no effect]." range="31:24" rwaccess="R/W"/>
	<bitfield id="AUTO_DETUNE" width="1" begin="23" end="23" resetval="0x0" description="When written with '1', automatic detuning is enabled. For the 'basic' functionality, thedetuning is done when 'shutdown_count' exceeds 'shutdown_threshold'. At that pointFROs that have a '1' in the TRNG_ALARMSTOP register are re-enabled in theTRNG_FROENABLE register, have their detune bit flipped in the TRNG_FRODETUNEregister and their bits cleared in the TRNG_ALARMMASK and TRNG_ALARMSTOPregisters. Also, the 'shutdown_oflo' bit in the TRNG_STATUS register will be set to '1'to indicate automatic detuning has been performed.Note: This bit can only be set to '1' when the 'shutdown_fatal' field ofTRNG_ALARMCNT is configured with '0'." range="23" rwaccess="R/W"/>
	<bitfield id="RESERVED_3" width="1" begin="22" end="22" resetval="0x0" description="Bits should be ignored on a read." range="22" rwaccess="W"/>
	<bitfield id="APROP_512" width="1" begin="21" end="21" resetval="0x1" description="0: [legacy] The Adaptive Proportion test works with a window size of4096bit, whichwas the size for earlier draft versions of [SP 800-90B].1:[default] The Adaptive Proportion test works with a window size of 512 bits, asspecified in [SP 800-90B]." range="21" rwaccess="R"/>
	<bitfield id="DETUNING_OPTION" width="2" begin="20" end="19" resetval="0x1" description="0: no automatic detuning functionality is present1:'basic' detuning functionality is present. Default for all standard configurations.Other values are reserved" range="20:19" rwaccess="R"/>
	<bitfield id="CONDITIONER" width="2" begin="18" end="17" resetval="0x0" description="0: no Conditioning Function is present or a BC_DF Conditioning Function is presentwhen an AES DRBG is present as well.1:a SHA1-based Conditioning Function is present.2:a SHA-256 based Conditioning Function is present.Other values are reserved." range="18:17" rwaccess="R"/>
	<bitfield id="PR_TEST" width="1" begin="16" end="16" resetval="0x1" description="Indicates that Monobit, poker and run test circuits are available." range="16" rwaccess="R"/>
	<bitfield id="RESERVED_1" width="1" begin="15" end="15" resetval="0x0" description="Bit should be ignored on a read." range="15" rwaccess="W"/>
	<bitfield id="BUFFER_SIZE" width="3" begin="14" end="12" resetval="0x0" description="Value 0 indicates no random data buffer is implemented, values 2  -  7 indicate thenumber of address bits used to address 128 bit buffer blocks in the random data buffer[so, value 2 indicates a 4 blocks/512 bits/64 Byte/16 word buffer while value 7 indicatesa 128 blocks/16K bits/2K Byte/512 word buffer]. Value 1 is reserved.This field corresponds to the value tied to the trng_buf_strap input of the EIP-76module." range="14:12" rwaccess="R"/>
	<bitfield id="NR_OF_FROS" width="6" begin="11" end="6" resetval="0x8" description="Number of FROs implemented in this TRNG, values 24 and 8 [decimal] are standardoptions available." range="11:6" rwaccess="R"/>
	<bitfield id="RESERVED_0" width="3" begin="5" end="3" resetval="0x0" description="Bits should be ignored on a read." range="5:3" rwaccess="W"/>
	<bitfield id="POST_PROCESSOR" width="3" begin="2" end="0" resetval="0x5" description="0: no DRBG is present [EIP-76a]5:an SP 800-90A AES-256 DRBG is present [EIP-76d].Other values reserved.Note: If the DRBG option is selected without selecting a Conditioning Function[conditioner_option = 0], then the DRBG will be fitted with BC_DF functionality." range="2:0" rwaccess="R"/>
	</register><register id="HSM_TRNG_TRNG_EIP_REV" acronym="HSM_TRNG_TRNG_EIP_REV" offset="124" width="32" description="EIP number and core revision.">
		<bitfield id="RESERVED_0" width="4" begin="31" end="28" resetval="0x0" description="Bits should be ignored on a read." range="31:28" rwaccess="W"/>
	<bitfield id="MAJOR_HW_REVISION" width="4" begin="27" end="24" resetval="0x2" description="4-bit binary encoding of the major hardware revision number." range="27:24" rwaccess="R/W"/>
	<bitfield id="MINOR_HW_REVISION" width="4" begin="23" end="20" resetval="0x4" description="4-bit binary encoding of the minor hardware revision number" range="23:20" rwaccess="R/W"/>
	<bitfield id="HW_PATCH_LEVEL" width="4" begin="19" end="16" resetval="0x1" description="4-bit binary encoding of the hardware patch level, initial release will carry value zero." range="19:16" rwaccess="R/W"/>
	<bitfield id="COMPLEMENT_OF_BASIC_EIP_NUMBER" width="8" begin="15" end="8" resetval="0x179" description="Bit-by-bit logic complement of bits [7:0]" range="15:8" rwaccess="R/W"/>
	<bitfield id="BASIS_EIP_NUMBER" width="8" begin="7" end="0" resetval="0x76" description="Bit-by-bit logic complement of bits [7:0]" range="7:0" rwaccess="R/W"/>
	</register>
</module>